# ElementIdSetFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIdSetFilter Constructor
ElementIdSetFilter Class See Also
---
Constructs a new instance of a filter wrapping a set of elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ElementIdSetFilter(
	ICollection<ElementId> idsToInclude
)
```

Visual Basic
---
```text
Public Sub New ( _
	idsToInclude As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
ElementIdSetFilter(
	ICollection<ElementId^>^ idsToInclude
)
```

# ### Parameters
idsToInclude
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input collection of ids was empty, or its contents were not valid for iteration. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace